app/services/climatiq_estimation_service.rb

  def self.calculate_carbon_emission(activity_id, value)
    activity_type = ActivityType.find(activity_id)
---
SELECT "activity_types".* FROM "activity_types" WHERE "activity_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]