app/services/climatiq_estimation_service.rb

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def self.calculate_carbon_emission(activity_id, value)
    activity = Activity.find(activity_id)