app/views/education/educational_content.html.erb

SELECT "contents".* FROM "contents" WHERE "contents"."content_type" = ?  [["content_type", "article"]]
---
          <!-- Check if the content_link is present and it's a video link -->
          <% if video.content_link.present? && video.content_type == 'video' %>