app/views/preferences/new.html.erb

        <h3 class="text-lg font-semibold mb-2"><%= category.capitalize %></h3>
        <% ActivityType.where(category: category).each_with_index do |activity_type, index| %>
---
SELECT "activity_types".* FROM "activity_types" WHERE "activity_types"."category" = ?  [["category", "energy"]]