app/views/user/show.html.erb

SELECT "activity_types".* FROM "activity_types"
SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 1]]
---
              <td class="border border-gray-400 px-4 py-2"><%= "#{activity.activity_type.name}" %></td>
              <td class="border border-gray-400 px-4 py-2"><%= activity.value.to_s + " " + activity.activity_type.climatiq_unit_of_measurement %></td>