app/controllers/activities_controller.rb

  def create
    @activity = Activity.new

    @activity.type_id = activity_params[:activity_type_id]
    @activity.user_id = current_user.id
    @activity.value = activity_params[:value].to_i

    @activity.carbon_emission = ClimatiqEstimationService.calculate_carbon_emission(activity_params[:activity_type_id], activity_params[:value].to_i).to_i

    if @activity.save
---
INSERT INTO "activities" ("user_id", "carbon_emission", "type_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["carbon_emission", 11], ["type_id", 1], ["value", 100], ["created_at", "2024-03-12 04:48:28.107104"], ["updated_at", "2024-03-12 04:48:28.107104"]]