app/controllers/activity_types_controller.rb

SELECT "activity_types".* FROM "activity_types" WHERE "activity_types"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    activity_type = ActivityType.find(params[:id])