app/controllers/dashboard_controller.rb

SELECT "activity_types".* FROM "activity_types" INNER JOIN "user_preferences" ON "activity_types"."id" = "user_preferences"."activity_type_id" WHERE "user_preferences"."user_id" = ?  [["user_id", 2]]
SELECT SUM("activities"."carbon_emission") AS "sum_carbon_emission", "activity_types"."name" AS "activity_types_name" FROM "activities" INNER JOIN "activity_types" ON "activity_types"."id" = "activities"."type_id" WHERE "activities"."user_id" = $1 GROUP BY "activity_types"."name"  [["user_id", 2]]
SELECT SUM("activities"."carbon_emission") AS "sum_carbon_emission", "activity_types"."category" AS "activity_types_category" FROM "activities" INNER JOIN "activity_types" ON "activity_types"."id" = "activities"."type_id" WHERE "activities"."user_id" = $1 GROUP BY "activity_types"."category"  [["user_id", 2]]
---
  def index
    @activities = Activity.all

    @carbon_emissions_by_activity_type = Activity.where(user_id: current_user.id).group("activity_types.name").joins(:activity_type).sum(:carbon_emission)

    @carbon_emissions_by_category = Activity.where(user_id: current_user.id).group("activity_types.category").joins(:activity_type).sum(:carbon_emission)