app/controllers/education_controller.rb

SELECT "contents".* FROM "contents" WHERE "contents"."content_type" = ?  [["content_type", "video"]]
---
  def educational_content
    @videos = Content.where(content_type: 'video')

INSERT INTO "contents" ("user_id", "content_type", "content_link", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @content = Content.new(content_params)

    # Add current user id to content
    @content.user_id = current_user.id

    if @content.save