app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 1]]
SELECT "activity_types".* FROM "activity_types"
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "activities" WHERE "activities"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "activity_types" INNER JOIN "user_preferences" ON "activity_types"."id" = "user_preferences"."activity_type_id" WHERE "user_preferences"."user_id" = ? AND "activity_types"."id" = ? LIMIT ?  [["user_id", 5], ["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @activities = Activity.where(user_id: current_user.id)
    activity_types = ActivityType.all

    # Map the activity types, put those that are already in the user's preferences in higher order and with a ⭐ in the name, and those that are not in the user's preferences in lower order
    sorted_activity_types = activity_types.sort_by { |activity_type| current_user.preferences.include?(activity_type) ? 0 : 1 }